<template>
<svg width="45" height="55" viewBox="0 0 45 55" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M6.7669 54.2354C5.28779 55.1968 3.78946 55.2516 2.2719 54.3996C0.757301 53.5506 0 52.2386 0 50.4637V4.53755C0 2.76262 0.757301 1.44918 2.2719 0.597217C3.78946 -0.251789 5.28779 -0.195582 6.7669 0.765835L42.931 23.7289C44.2622 24.6164 44.9278 25.8736 44.9278 27.5006C44.9278 29.1276 44.2622 30.3849 42.931 31.2723L6.7669 54.2354Z" :fill="color"/>
</svg>

</template>

<script setup lang="ts">
withDefaults(
    defineProps<{
        /** 图标填充颜色，支持任意合法 CSS 颜色值 */
        color?: string
    }>(),
    { color: '#fff' }
)
</script>
